{
  "data": [
    {
      "id": "1028",
      "code": "gwuby345v",
      "title": "Le Petit Prince",
      "subtitle": "avec des aquarelles de l'auteur",
      "author": "Antoine de Saint-Exupéry",
      "description": "Un petit garçon apprend les merveilles et les ironies de la vie pendant une odyssée céleste",
      "images": "book1.png",
      "pageCount": 113,
      "publishedDate": "2001-04-30",
      "price": 56,
      "category": "Jeunesse",
      "quantity": 25,
      "language": "fr",
      "inventoryStatus": "INSTOCK",
      "rating": 5
    },
    {
      "id": "1029",
      "code": "kopml345v",
      "title": "Harry Potter et la Chambre",
      "subtitle": "",
      "author": "J.K. Rowling",
      "description": "Une rentrée fracassante en voiture volante, une étrange malédiction qui s’abat sur les élèves, cette deuxième année à l’école des sorciers ne s’annonce pas de tout repos! Entre les cours de potions magiques, les matches de Quidditch et les combats de mauvais sorts, Harry et ses amis Ron et Hermione trouveront-ils le temps de percer le mystère de la Chambre des Secrets?",
      "images": "book2.png",
      "pageCount": 393,
      "publishedDate": "2017",
      "price": 23.5,
      "category": "Littérature et Fiction",
      "quantity": 10,
      "language": "fr",
      "inventoryStatus": "LOWSTOCK",
      "rating": 3
    },
    {
      "id": "1030",
      "code": "vguby345v",
      "title": "Le Comte de Monte-Cristo",
      "subtitle": "préface Jean-Yves Tadié",
      "author": "Alexandre Dumas",
      "description": "L'intrigue se résume en une ligne : Edmond Dantès, injustement condamné, revient se venger quatorze ans plus tard. Le héros principal a la grandeur des principales créations romantiques, d'Hernani, de Jean Valjean, de Julien Sorel. Il atteint même, par ses allures de surhomme dévoué à sa mission, une grandeur épique.",
      "images": "book3.png",
      "pageCount": 1260,
      "publishedDate": "2020",
      "price": 52,
      "category": "Littérature",
      "quantity": 30,
      "language": "fr",
      "inventoryStatus": "INSTOCK",
      "rating": 4.8
    },
    {
      "id": "1031",
      "code": "oiuyby345v",
      "title": "The Hidden Key to Harry Potter",
      "subtitle": "Understanding the Meaning, Genius, and Popularity of Joanne Rowling's Harry Potter Novels",
      "author": "John Granger",
      "description": "The Hidden Key to Harry Potter is the first book to take Harry Potter seriously as literature. Low read critics have panned the bestselling novels as the literary equivalent of fast food and as a gateway to the occult. But no one has explained the worldwide popularity of Ms. Rowling's fiction or read it as one would read Tolkien, Hemingway, or Shakespeare. The Hidden Key takes the high road to understanding Harry Potter's success through an exploration of the series' structure, themes, and symbolism. The astonishing conclusion of this investigation is that Ms. Rowling, demonized by some Christian critics because of its magical setting of her books, is ironically writing the most charming and challenging Christian fiction for children since Lewis' Chronicles of Narnia.",
      "images": "book4.png",
      "price": 65,
      "pageCount": 364,
      "publishedDate": "2002",
      "category": "Children",
      "language": "en",
      "quantity": 30,
      "inventoryStatus": "INSTOCK",
      "rating": 5
    },
    {
      "id": "1032",
      "code": "lpmo345v",
      "title": "Harry Potter, les raisons d'un succès",
      "subtitle": "",
      "author": "Isabelle Smadja",
      "description": "Cet essai repère dans les contes et légendes, dans la mythologie, le récit biblique et l'histoire contemporaine, les sources de l'inspiration de Rowling, l'étonnante créatrice de Harry Potter. I. Smadja ne peut que constater que cette série est à la jonction d'un passé commun à tous les peuples. Mais pourquoi avoir choisi l'univers de la sorcellerie avec fantômes et devins pour parler des hommes et de leurs défauts ? Ce choix aurait-il une fonction ? I. Smadja y voit un procédé destiné à pénétrer dans l'inconscient de l'enfant en échappant à la censure. Elle analyse les désirs secrets, inavouables, comblés par la lecture des \"aventures\" et de l'éducation de Harry, ainsi que les valeurs transmises par Rowling. Elle essaie ainsi de répondre à l'éternelle question que se posent parents et éducateurs : à quel monde rêvent nos enfants ?",
      "images": "book5.jpg",
      "price": 15,
      "pageCount": 152,
      "publishedDate": "2001-11",
      "category": "Literary Criticism",
      "language": "fr",
      "quantity": 20,
      "inventoryStatus": "INSTOCK",
      "rating": 2
    },
    {
      "id": "1033",
      "code": "nklp345v",
      "title": "The Unofficial Harry Potter Vegan Cookbook",
      "subtitle": "Extraordinary Plant-based Meals Inspired by the Realm of Wizards and Witches",
      "author": "Imana Grashuis & Tylor Starr",
      "description": "This beautiful book is the first completely vegan Harry Potter-themed cookbook. Packed with more than 75 recipes and breath-taking, eye-popping photography, the book captures the magic of Hogwarts on each and every page.",
      "images": "book6.jpg",
      "price": 26,
      "pageCount": 100,
      "publishedDate": "2022-11",
      "category": "Cooking",
      "language": "en",
      "quantity": 10,
      "inventoryStatus": "INSTOCK",
      "rating": 3.5
    },
    {
      "id": "1034",
      "code": "qzert345v",
      "title": "Harry Potter and the Sorcerer's Stone",
      "subtitle": "Early Intermediate Piano Solos",
      "author": "John Williams & Gail Lew",
      "description": "These exciting, easy arrangements of John Williams' motion picture score capture the sounds and characters from this thrilling movie. Muggles of all ages will want to play these memorable themes including: * Hedwig's Theme * Harry's Wondrous World * Diagon Alley * Hogwarts Forever! * Quidditch Match * Voldemort * Nimbus 2000 * Family Portrait This great piano collection may be used just for fun or as supplementary study along with Level Three or Level Four piano methods.",
      "images": "book7.jpg",
      "price": 20,
      "pageCount": 32,
      "publishedDate": "2001-12-04",
      "category": "Music",
      "language": "en",
      "quantity": 10,
      "inventoryStatus": "INSTOCK",
      "rating": 2.5
    }
  ]
}